oh my bash

zsh
oh my zsh
    sh -c "$(curl -fsSL https://raw.githubusercontent.com/ohmyzsh/ohmyzsh/master/tools/install.sh)"
fd
rg
fzf
htop
    sudo apt install htop
bat
exa
tldr
trash-cli
vifm
    sudo apt install vifm
neofetch
ffmpeg
stow
fdupes
cmus
nmap
ncdu
    sudo apt install ncdu
#open-fprintd had issues in kde ubuntu
open-fprintd
    sudo apt remove fprintd
    sudo add-apt-repository ppa:uunicorn/open-fprintd
    sudo apt-get update
    sudo apt install open-fprintd fprintd-clients python3-validity

# Exif Jpeg header manipulation tool
jhead
    sudo apt install jhead


#programming
lazygit
    sudo add-apt-repository ppa:lazygit-team/release
    sudo apt-get update
    sudo apt-get install lazygit
docker
docker-compose
python
ipython
bpython
ptpython
    pip install ptpython
virtualenvwrapper
    sudo pip install virtualenvwrapper
pipenv
    pip install pipenv
nasm
rust
golang
ngrok
heroku cli
    sudo apt install heroku
inotify-tools
    sudo apt install inotify-tools
nvm

# Graphical programs
google-chrome
gimp
    sudo apt install gimp
texStudio
subilme text
vs code
keePassXC
Fluxgui
stellarium
save eyes
kdenlive
scan tailor
scan tailor advanced
gscan2pdf
ocrfeeder
kile
timeshift
    sudo add-apt-repository -y ppa:teejee2008/timeshift
    sudo apt-get update
    sudo apt-get install timeshift
filelight
    sudo apt-get install -y filelight
virtualbox
flameshot
    sudo apt install flameshot
Mega Sync
    curl https://mega.nz/linux/MEGAsync/xUbuntu_20.04/amd64/megasync_4.5.3-2.1_amd64.deb -o /tmp/megasync.deb
    sudo apt install /tmp/megasync.deb
Mega Sync Dolphin intergration
    curl https://mega.nz/linux/MEGAsync/xUbuntu_20.04/amd64/dolphin-megasync_4.1.1+4.1_amd64.deb -o /tmp/dolphin-megasync.deb
    sudo apt install /tmp/dolphin-megasync.deb
Mega cli
    curl https://mega.nz/linux/MEGAsync/xUbuntu_20.04/amd64/megacmd_1.4.0-5.1_amd64.deb -o /tmp/megacmd.deb
    sudo apt install /tmp/megacmd.deb

